[
	{
		"nazwa": "CSSOff 2011",
			"adres": "robertkirsz.pl/projekty/cssoff2011",
			"screenshot": {
				"desktop": "TripleDare.jpg",
				"mobile": "TripleDareMobile.jpg" },
			"responsywnosc": {
				"desktop": "true",
				"tablet": "true",
				"mobile": "true" },
			"opis": "Strona przygotowana na konkurs CSSOff, organizowany przez <a href=\"http://unmatchedstyle.com/news/cssoff-winners-2012.php\">unmatchedstyle.com</a>. Zadaniem było zakodowanie strony na podstawie otrzymanego projektu graficznego. Nadesłano ponad 400 zgłoszeń, zająłem wtedy miejsce w połowie stawki. Było to moje pierwsze podejście do kodowania w sposób responsywny i pokochałem to od pierwszego wejrzenia."
	},
	{
		"nazwa": "CSSOff 2013",
			"adres": "robertkirsz.pl/projekty/cssoff2013",
			"screenshot": {
				"desktop": "CSSOffVolume3.jpg",
				"mobile": "CSSOffVolume3Mobile.jpg" },
			"responsywnosc": {
				"desktop": "true",
				"tablet": "false",
				"mobile": "true" },
			"opis": "Kolejna edycja konkursu CSSOff, z dużo bardziej złożonym layoutem. Nie miałem jednak wtedy wystarczająco dużo wolnego czasu aby stronę skończyć i zgłosić do oceny, ale z tego co widzę na <a href=\"http://www.unmatchedstyle.com/cssoff\">stronie</a>, konkurs chyba nie został rozstrzygnięty. Obecnie ukończona jest w jakichś 90%."
	},
	{
		"nazwa": "Projektowanie wnętrz",
			"adres": "robertkirsz.pl/projekty/interiordesign",
			"screenshot": {
				"desktop": "InteriorDesign.jpg",
				"mobile": "InteriorDesignMobile.jpg" },
			"responsywnosc": {
				"desktop": "true",
				"tablet": "false",
				"mobile": "true" },
			"opis": "Strona internetowa dla firmy zajmującej się projektowaniem wnętrz. Stworzona w oparciu o dostarczony projekt graficzny, niepodparta żadnym frameworkiem, z własnymi rozwiązaniami odnośnie RWD. Strona nie została ukończona ponieważ firma ostatecznie nie ruszyła."
	},
	{
		"nazwa": "vikaplant",
			"adres": "vikaplant.pl",
			"screenshot": {
				"desktop": "Vikaplant.jpg",
				"mobile": "VikaplantMobile.jpg" },
			"responsywnosc": {
				"desktop": "true",
				"tablet": "true",
				"mobile": "true" },
			"opis": "Prosta strona zbudowana na Bootstrapie, pierwszy projekt na tym frameworku. Uwielbiam kodować, ale design to zdecydowanie nie moja specjalność."
	},
	{
		"nazwa": "Symulator Gitary",
			"adres": "robertkirsz.pl/gitary",
			"screenshot": {
				"desktop": "Gitary.jpg",
				"mobile": "" },
			"responsywnosc": {
				"desktop": "true",
				"tablet": "false",
				"mobile": "false" },
			"opis": "Aplikacja multimedialna stworzona na potrzeby mojej pracy inżynierskiej i jednocześnie pierwsze poważniejsze podejście do programowania w JavaScripcie. Jest to symulator gitary wykorzystujący standard HTML5 Audio. Pozwala na zapisywanie akordów, nagrywanie sekwencji dźwięków, tworzeniu na ich podstawie zapisu w formie tabulatury i inne. Wszystkie jej funkcje są opisane w okienku pomocy, do którego można się dostać poprzez ikonę w prawym dolnym rogu ekranu głównego. Pełnię funkcjonalności i wydajności osiąga w najnowszym, desktopowym Chromie i Firefoxie (nie była tworzona z myślą o innych przeglądarkach czy urządzeniach mobilnych)."
	},
	{
		"nazwa": "MtG Life Counter",
			"adres": "robertkirsz.pl/mtg",
			"screenshot": {
				"desktop": "",
				"mobile": "lifecounter.jpg" },
			"responsywnosc": {
				"desktop": "false",
				"tablet": "true",
				"mobile": "true" },
			"opis": "Aplikacja stworzona z myślą o fanach gry karcianej Magic: The Gathering. Jej funkcjonalność może być czarną magią dla zwykłych śmiertelników. Pozwala śledzić aktualną ilość życia, liczbę poison counterów, obrażenia zadane przez Commandera oraz umożliwia zagrywanie tokenów. W fazie testowej jest także opcja zapisywania statystyk z poszczególnych rozgrywek. Stworzona z myślą o urządzeniach mobilnych, testowana na Androidzie 4.3 z najnowszym Chromem. W wersji desktopowej symulowany jest wygląd aplikacji na smartfonie."
	},
	{
		"nazwa": "Saper",
			"adres": "robertkirsz.pl/saper",
			"screenshot": {
				"desktop": "Saper.jpg",
				"mobile": "" },
			"responsywnosc": {
				"desktop": "true",
				"tablet": "true",
				"mobile": "true" },
			"opis": "Klon kultowego Sapera znanego z Windowsów, moje pierwsze podejście do stworzenia czegoś w rodzaju gry. Stworzony głównie z myślą o desktopach i obsłudze myszką, jest jednak maksymalnie responsywny i powinien wyświetlać się poprawnie na ekranach o wszystkich rozmiarach."
	},
	{
		"nazwa": "Black Tangerine",
			"adres": "robertkirsz.pl/projekty/blacktangerine",
			"screenshot": {
				"desktop": "BlackTangerine.jpg",
				"mobile": "" },
			"responsywnosc": {
				"desktop": "true",
				"tablet": "false",
				"mobile": "false" },
			"opis": "Bonusowo strona, którą zrobiłem dla agencji reklamowej, w której pracowałem przez chwilę po studiach. Był to mój pierwszy projekt nie \"do szuflady\". O designie responsywnym jeszcze się wtedy nie mówiło. Śladowe ilości JavaScript, dzięki którym udało mi się zrobić super nowoczesną nawigację, to było wszystko na co było mnie wtedy stać. Sporo się zmieniło od tamtego czasu."
	}
]